import classes from './Nav.module.scss';
import React from 'react';
import Link from '../Link/Link';
const Nav = () => {
  return (
    <nav className={classes.nav}>
      <div className={classes.nav__inner}>
        <div className={classes.navItem}>
          <Link to="catalog" filled={true}>
            Каталог
          </Link>
        </div>
        <div className={classes.navItem}>
          <Link to="delivery" filled={true}>
            Доставка
          </Link>
        </div>
        <div className={classes.navItem}>
          <Link to="contacts" filled={true}>
            Контакты
          </Link>
        </div>
        <div className={classes.navItem}>
          <Link to="cart">
            <svg
              width="31"
              height="27"
              viewBox="0 0 31 27"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M11.3332 16.375V19.25M19.6668 16.375V19.25M7.16643 10.625L12.7221 2M23.8336 10.625L18.2779 2M2.04128 12.4104C1.99023 12.1985 1.98648 11.9774 2.03031 11.7638C2.07415 11.5502 2.16443 11.3498 2.29429 11.1777C2.42415 11.0056 2.59018 10.8664 2.77978 10.7706C2.96938 10.6749 3.17757 10.6251 3.38854 10.625H27.6115C27.8224 10.6251 28.0306 10.6749 28.2202 10.7706C28.4098 10.8664 28.5759 11.0056 28.7057 11.1777C28.8356 11.3498 28.9258 11.5502 28.9697 11.7638C29.0135 11.9774 29.0098 12.1985 28.9587 12.4104L26.4434 22.8222C26.2931 23.4442 25.9464 23.9963 25.4582 24.3909C24.9699 24.7855 24.3683 24.9999 23.7488 25H7.25115C6.6317 24.9999 6.03006 24.7855 5.54184 24.3909C5.05362 23.9963 4.70685 23.4442 4.55663 22.8222L2.04128 12.4118V12.4104Z"
                stroke="#6B08BA"
                stroke-width="3"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </Link>
        </div>
        <div className={classes.navItem}>
          <Link to="catalog">
            <svg
              width="27"
              height="27"
              viewBox="0 0 27 27"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M25 25L19.5696 19.5599M22.5789 12.2895C22.5789 15.0184 21.4949 17.6356 19.5652 19.5652C17.6356 21.4949 15.0184 22.5789 12.2895 22.5789C9.56054 22.5789 6.94337 21.4949 5.01372 19.5652C3.08407 17.6356 2 15.0184 2 12.2895C2 9.56054 3.08407 6.94337 5.01372 5.01372C6.94337 3.08407 9.56054 2 12.2895 2C15.0184 2 17.6356 3.08407 19.5652 5.01372C21.4949 6.94337 22.5789 9.56054 22.5789 12.2895Z"
                stroke="#6B08BA"
                stroke-width="3"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </Link>
        </div>
        <div className={classes.navItem}>
          <Link to="profile">
            <svg
              width="24"
              height="27"
              viewBox="0 0 24 27"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M17.7245 15.8H18.1275C18.9645 15.8002 19.7726 16.1075 20.4 16.664C21.0274 17.2205 21.4309 17.9879 21.5347 18.8222L21.9823 22.4148C22.0226 22.7384 21.9939 23.067 21.8981 23.3786C21.8023 23.6903 21.6416 23.9779 21.4266 24.2224C21.2117 24.4669 20.9475 24.6626 20.6515 24.7967C20.3554 24.9308 20.0344 25.0001 19.7097 25H4.29029C3.96557 25.0001 3.64456 24.9308 3.34855 24.7967C3.05254 24.6626 2.7883 24.4669 2.57338 24.2224C2.35845 23.9779 2.19775 23.6903 2.10194 23.3786C2.00613 23.067 1.97741 22.7384 2.01767 22.4148L2.46418 18.8222C2.56802 17.9876 2.97184 17.2198 3.59972 16.6632C4.2276 16.1067 5.03627 15.7997 5.87367 15.8H6.27553M17.7245 7.75C17.7245 10.9256 15.1615 13.5 12 13.5C8.83846 13.5 6.27553 10.9256 6.27553 7.75C6.27553 4.57436 8.83846 2 12 2C15.1615 2 17.7245 4.57436 17.7245 7.75Z"
                stroke="#6B08BA"
                stroke-width="3"
                stroke-linecap="round"
                stroke-linejoin="round"
              />
            </svg>
          </Link>
        </div>
      </div>
    </nav>
  );
};

export default Nav;
